Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException
The exception that is thrown when making or attempting to make changes that are forbidden during dynamic updates to the model.
Remarks: Modifications leading to a new mutual relationship between
elements that did not depend on each other before are potentially
not safe in work-set environment. This exception is thrown when
an Updater either makes such modifications or attempts to call
a method that will or may modify the model in such unsafe matter.